export const sidebarItems = [
    { type: "juz", number: 1 },
    { type: "surah", number: 1, name: "Аль-Фатиха" },
    { type: "ruku", id: 1, title: "Наилучшая молитва", tags: ["Молитвы"], chapter: 1, from: 1, to: 7, juz: 1 , description: [
            {
                text: "Лучшая молитва наученная Самим ﷲ",
                ref: "1:[1–7]"
            }]},

    { type: "surah", number: 1, name: "Аль-Бакара" },
    {
        type: "ruku",
        id: 2,
        title: "1. Богобоязненные и куффары",
        description: [
            {
                text: "Это руководство для богобоязненных",
                ref: "2:[1–5]"
            },
            {
                text: "Предупреждение бесполезно для тех, кто отвергает веру",
                ref: "2:[6–7]"
            }
        ],
        tags: ["Неверующие", "Коран"],
        chapter: 2,
        from: 1,
        to: 7,
        juz: 1,
        boldSeparators: [5]
    },
    {
        type: "ruku",
        id: 3,
        title: "2. Мунафики",
        description: [
            {
                text: "Мунафики и последствия нифак",
                ref: "2:[8–16]"
            },
            {
                text: "Аналогии о них",
                ref: "2:[17–20]"
            }
        ],
        tags: [],
        chapter: 2,
        from: 8,
        to: 20,
        juz: 1,
        boldSeparators: [16]
    },
    {
        type: "ruku",
        id: 4,
        title: "3. Обращение ﷲ к человечеству",
        description: [
            {
                text: "Требование ﷲ поклоняться исключительно Ему",
                ref: "2:[21–22]"
            },
            {
                text: "Утверждение, что Коран — Писание ﷲ",
                ref: "2:[23–24]"
            },
            {
                text: "Награда для верующих",
                ref: "2:[25]"
            },
            {
                text: "Притча о комаре: одних сбивает, других просвещает",
                ref: "2:[26–27]"
            },
            {
                text: "Как вы можете отвергать ﷲ?",
                ref: "2:[28–29]"
            }
        ],
        tags: [],
        chapter: 2,
        from: 21,
        to: 29,
        juz: 1,
        boldSeparators: [22, 24, 25, 27, 29]
    },
    {
        type: "ruku",
        id: 5,
        title: "4. Адам ﵇ — первый человек",
        description: [
            { text: "История создания Адама ﵇", ref: "2:[30]" },
            { text: "\tПобеда знания", ref: "2:[31–33]" },
            { text: "\tАнгелы выражают уважение Адаму ﵇", ref: "2:[34–35]" },
            { text: "\tШайтан стал причиной лишения Рая", ref: "2:[36]" },
            { text: "\tПокаяние Адама ﵇ и его прощение", ref: "2:[37]" }
        ],
        tags: [],
        chapter: 2,
        from: 30,
        to: 37,
        juz: 1,
        boldSeparators: [30, 33, 35, 36, 37]
    },
    {
        type: "ruku",
        id: 6,
        title: "5. Обращение к Сынам Израиля",
        description: [
            { text: "Необходимость в откровениях ﷲ для руководства", ref: "2:[38-39]" },
            { text: "Завет ﷲ с Сынами Израиля", ref: "2:[40–43]" },
            { text: "Вы наставляете других, но забываете себя?", ref: "2:[44]" },
            { text: "Помощь Аллаха приходит с терпением и Салятом", ref: "2:[45-46]" },
        ],
        tags: [],
        chapter: 2,
        from: 38,
        to: 46,
        juz: 1,
        boldSeparators: [39, 43, 44, 46]
    },
    {
    "type": "ruku",
    "id": 7,
    "title": "6. Спасение сынов Израиля от Фараона",
    "chapter": 2,
    "from": 47,
    "to": 59,
    "juz": 1,
    "boldSeparators": [
        48,
        50,
        52,
        54,
        57
    ],
    "tags": [],
    "description": [
        {
            "text": "Преступники не найдут спасения в Судный День",
            "ref": "2:[47-48]"
        },
        {
            "text": "Спасение Израильтян от преследований Фараона",
            "ref": "2:[49-50]"
        },
        {
            "text": "\tГрех поклонения сынов Израиля тельцу",
            "ref": "2:[51-52]"
        },
        {
            "text": "\tИх покаяние путем убийства виновных",
            "ref": "2:[53-54]"
        },
        {
            "text": "\tСыны Израиля, которые хотели увидеть Аллаха",
            "ref": "2:[55-57]"
        },
        {
            "text": "\tНеблагодарность и неверие сынов Израиля",
            "ref": "2:[58-59]"
        }
    ]},
    {
    "type": "ruku",
    "id": 8,
    "title": "7. Сыны Израиля отвергли аяты ﷲ",
    "chapter": 2,
    "from": 60,
    "to": 61,
    "juz": 1,
    "boldSeparators": [
        60
    ],
    "tags": [],
    "description": [
        {
            "text": "Чудо выведения воды из камня",
            "ref": "2:[60]"
        },
        {
            "text": "Сыны Израиля отвергают небесную еду",
            "ref": ""
        },
        {
            "text": "\tНеподчинение и ослушание сынов Израиля",
            "ref": "2: [61]"
        }
    ]},
    {
    "type": "ruku",
    "id": 9,
    "title": "8. Сыны Израиля нарушили завет с ﷲ",
    "chapter": 2,
    "from": 62,
    "to": 71,
    "juz": 1,
    "boldSeparators": [
        62,
        64,
        66
    ],
    "tags": [],
    "description": [
        {
            "text": "Настоящим уверовавшим нечего бояться и не о чем сожалеть",
            "ref": "2:[62]"
        },
        {
            "text": "Сыны Израиля заключили завет с ﷲ",
            "ref": "2:[63-64]"
        },
        {
            "text": "\tНаказание для нарушевших Шаббат",
            "ref": "2:[65-66]"
        },
        {
            "text": "\tОтношение сынов Израиля к жертвоприношению по приказу ﷲ",
            "ref": "2:[67-71]"
        }
    ]},
]
